# How to fetch last row of each group using pandas ?

In [2]:
import numpy as np
import pandas as pd

### Creating Scenario

In [3]:
# Dummy Data
df = pd.DataFrame({"Year":['2019', '2019', '2019', '2019', 
                           '2018', '2018', '2018', '2018', 
                           '2017','2017', '2017', '2017'],
                  "Sales":[5000, 6000, 2000, 3000, 
                           2300, 1400, 5400, 6200,
                           7230, 5600, 3200, 1600],
                  "Profit":[700,456,1000,234,
                             876,352,785,236,
                             549,430,123,678]})
df

    Year  Sales  Profit
0   2019   5000     700
1   2019   6000     456
2   2019   2000    1000
3   2019   3000     234
4   2018   2300     876
5   2018   1400     352
6   2018   5400     785
7   2018   6200     236
8   2017   7230     549
9   2017   5600     430
10  2017   3200     123
11  2017   1600     678

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
Year      12 non-null object
Sales     12 non-null int64
Profit    12 non-null int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

### Using `groupby()` and `head()` in pandas

In [6]:
df.groupby("Year").head(1)

   Year  Sales  Profit
0  2019   5000     700
4  2018   2300     876
8  2017   7230     549

In [15]:
# df.groupby("Year").head(2)

### Using `groupby()` and `first()` in pandas

In [19]:
df.groupby("Year").first().reset_index()

   Year  Sales  Profit
0  2017   7230     549
1  2018   2300     876
2  2019   5000     700

### Using `groupby()` and `nth()` in pandas

In [24]:
df.groupby("Year").nth(-1)

      Sales  Profit
Year
2017   1600     678
2018   6200     236
2019   3000     234

### Summary
 - df.groupby("Year").head(1)
 - df.groupby("Year").first()
 - df.groupby("Year").nth(0)